In [1]:
myDict = {"name": "John", "country": "Norway"}
mySeparator = "TEST"

x = mySeparator.join(myDict.values())

x

'JohnTESTNorway'

In [2]:
'a*b*c'.split('*')

['a', 'b', 'c']

In [3]:
s = "this is my string"
s.split(maxsplit= -1)

['this', 'is', 'my', 'string']

In [4]:
import pandas as pd
import numpy as np


df = pd.DataFrame({
    "date": pd.date_range('2022/1/1','2022/1/10', periods=10),
    "name": ('Tunde', 'Funmi', 'Jola', 'Fola', 'Theo', 'Dammy', 'Kemi', 'Junia', 'Hadassah','Adedeji'),
    "age": np.random.randint(4,45, size=10),
    "frequency": [20,34,77,np.nan,44,np.nan,88,77,np.nan,57]   
})

df

        date      name  age  frequency
0 2022-01-01     Tunde   26       20.0
1 2022-01-02     Funmi   12       34.0
2 2022-01-03      Jola   33       77.0
3 2022-01-04      Fola    8        NaN
4 2022-01-05      Theo   44       44.0
5 2022-01-06     Dammy   17        NaN
6 2022-01-07      Kemi   20       88.0
7 2022-01-08     Junia    7       77.0
8 2022-01-09  Hadassah   20        NaN
9 2022-01-10   Adedeji   37       57.0

In [5]:
df["frequency"].reset_index()

   index  frequency
0      0       20.0
1      1       34.0
2      2       77.0
3      3        NaN
4      4       44.0
5      5        NaN
6      6       88.0
7      7       77.0
8      8        NaN
9      9       57.0

In [6]:
df[df["age"] > 20].set_index()

TypeError: set_index() missing 1 required positional argument: 'keys'

In [ ]:
np.random.randn(5,)

array([ 0.68354729,  0.33057686,  2.12321477,  0.79020309, -0.54053269])

In [ ]:
# importing pandas package
#import pandas as pd

# making data frame from csv file
data = pd.read_csv("/Users/macos/Downloads/employees.csv")

# setting first name as index column
data.set_index(["First Name"], inplace = True, append = True, drop = True)

# resetting index
data.reset_index(inplace = True)

# display
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   level_0            1000 non-null   int64
 1   First Name         933 non-null    object
 2   Gender             855 non-null    object
 3   Start Date         1000 non-null   object
 4   Last Login Time    1000 non-null   object
 5   Salary             1000 non-null   int64
 6   Bonus %            1000 non-null   float64
 7   Senior Management  933 non-null    object
 8   Team               957 non-null    object
dtypes: float64(1), int64(2), object(6)
memory usage: 70.4+ KB

In [ ]:
data.sample(frac=0.5)

,level_0,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
746,746,Gloria,Female,8/19/2004,10:31 AM,46602,1.027,True,Business Development
275,275,Debra,Female,2/22/1994,10:25 PM,104250,18.456,True,Business Development
977,977,Sarah,Female,12/4/1995,9:16 AM,124566,5.949,False,Product
77,77,Charles,Male,9/14/2004,8:13 PM,107391,1.260,True,Marketing
954,954,Joe,Male,1/19/1980,4:06 PM,119667,1.148,True,Finance
...,...,...,...,...,...,...,...,...,...
537,537,Cynthia,Female,9/14/1991,1:08 PM,51633,13.472,True,Business Development
689,689,Julie,NaN,5/8/1980,6:31 AM,50529,17.263,False,Finance
114,114,Ashley,Female,8/4/2002,11:00 AM,58698,6.811,True,Business Development
290,290,Jeremy,Male,6/14/1988,6:20 PM,129460,13.657,True,NaN
823,823,NaN,Male,11/12/2009,2:30 PM,109411,9.494,NaN,Engineering

In [ ]:
import numpy as np
import pandas as pd
s = pd.Series([2, 3, 4, 5], name='f1',index=pd.Index(['p', 'q', 'r', 's'], name='idx'))
#s.reset_index()			  
series_df = pd.DataFrame(s)
series_df.reset_index()

  idx  f1
0   p   2
1   q   3
2   r   4
3   s   5

In [ ]:

for i in range(3):
    n = i**2
print(i)

2

In [ ]:
[a**2 for a in range(3)]
#print(a)

[0, 1, 4]

In [ ]:
{"userId": 1,  "name": "rahul", "completed": False}.values()

dict_values([1, 'rahul', False])

In [ ]:
class Number:
    integers = [5,6,7]
    for i in integers:
        i * 2

Number.i

7

In [ ]:
joinlist = ["tunde", "funmi", "jols", "fola", "theo"]
" @ ".join(joinlist)

'tunde @ funmi @ jols @ fola @ theo'

In [ ]:
cities = ["Vancouver", "Oslo", "Houston", "Toronto", "Lagos", "Holguín"]
any(city.endswith("o") for city in cities)

True

In [ ]:
all("o" in city for city in cities)

True

In [ ]:
"Houston".index('o')

1

In [ ]:
[city for city in cities if city.startswith("H")]

['Houston', 'Holguín']

In [ ]:
language = "Python"
class Snake:
    language += " boa"

Snake.language

'Python boa'

In [ ]:
lst = []
lst.append('Python')
lst

['Python']

In [ ]:
lst.extend('Go')
lst

['Python', 'G', 'o']

In [ ]:
lst.extend(['duck','dog'])
lst

['Python', 'G', 'o', 'duck', 'dog']

In [ ]:
lst.append(['bird','rat'])
lst

['Python', 'G', 'o', 'duck', 'dog', ['bird', 'rat'], ['bird', 'rat']]

In [ ]:
cars = ['Mitsubishi', 'BMW', 'Volvo', 'Mercedes', 'Ford' ]

In [ ]:
cars.sort(key=lambda x: len(x))
print(cars)

['BMW', 'Ford', 'Volvo', 'Mercedes', 'Mitsubishi']

In [ ]:
a = b = [7,3,5,9,1]

b.append(2)
b

[7, 3, 5, 9, 1, 2]

In [ ]:
b

[7, 3, 5, 9, 1, 2]

In [ ]:
c = d = [4,8,1,9,3]
sorted(c)

[1, 3, 4, 8, 9]

In [ ]:
c

[4, 8, 1, 9, 3]

In [ ]:
x = y = 'a,b,c'
x.split(",")

['a', 'b', 'c']

In [ ]:
y

'a,b,c'

In [ ]:
x

'a,b,c'

In [7]:
import pandas as pd
pd.show_versions()

/Users/macos/opt/anaconda3/lib/python3.9/site-packages/_distutils_hack/__init__.py:30: UserWarning: Setuptools is replacing distutils.
  warnings.warn("Setuptools is replacing distutils.")

INSTALLED VERSIONS
------------------
commit           : 4bfe3d07b4858144c219b9346329027024102ab6
python           : 3.9.12.final.0
python-bits      : 64
OS               : Darwin
OS-release       : 22.1.0
Version          : Darwin Kernel Version 22.1.0: Sun Oct  9 20:14:54 PDT 2022; root:xnu-8792.41.9~2/RELEASE_X86_64
machine          : x86_64
processor        : i386
byteorder        : little
LC_ALL           : None
LANG             : None
LOCALE           : None.UTF-8

pandas           : 1.4.2
numpy            : 1.21.5
pytz             : 2021.3
dateutil         : 2.8.2
pip              : 21.2.4
setuptools       : 61.2.0
Cython           : 0.29.28
pytest           : 7.1.1
hypothesis       : None
sphinx           : 4.4.0
blosc            : None
feather          : None
xlsxwriter       : 3.0.3
lxml.etree       : 4.8.0
html5lib         : None
pymysql          : None
psycopg2         : None
jinja2           : 2.11.3
IPython          : 8.2.0
pandas_datareader: None
bs4              : 4.11.1
bottleneck       : 1.3.4
brotli           :
fastparquet      : None
fsspec           : 2022.02.0
gcsfs            : None
markupsafe       : 2.0.1
matplotlib       : 3.5.1
numba            : 0.55.1
numexpr          : 2.8.1
odfpy            : None
openpyxl         : 3.0.9
pandas_gbq       : None
pyarrow          : None
pyreadstat       : None
pyxlsb           : None
s3fs             : None
scipy            : 1.7.3
snappy           :
sqlalchemy       : 1.4.32
tables           : 3.6.1
tabulate         : 0.8.9
xarray           : 0.20.1
xlrd             : 2.0.1
xlwt             : None
zstandard        : None